channel500M1/system/surfaces
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2012
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out surface files with interpolated field data in VTK format, e.g.
    cutting planes, iso-surfaces and patch boundary surfaces.

    This file includes a selection of example surfaces, each of which the user
    should configure and/or remove.

\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/visualization/surfaces.cfg"

fields       (p pMean pPrime2Mean);

surfaces
(
    // zNormal
    // {
    //     $cuttingPlane;
    //     pointAndNormalDict
    //     {
    //         point    (0.01 0 0.0); // Overrides default basePoint (0 0 0)
    //         normal   $z;      // $y: macro for (0 0 1)
    //     }
    // }
    bottomWall
    {
        type patch;
        patches ("bottomWall");
        interpolate     false;
        invariant       true;  // Unaffected by mesh motion
        surfaceFormat   foam; //ensight vtk foam
    }
    topWall
    {
        type patch;
        patches ("topWall");
        interpolate     false;
        invariant       true;  // Unaffected by mesh motion
        surfaceFormat   foam; //ensight vtk foam
    }
);

writeControl    adjustableRunTime;
writeInterval	0.001;
purgeWrite      1000;

// ************************************************************************* //
